Revit 2024 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceInvalidSpacing Property
 Constraints not satisfied, cannot generate gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedSurfaceInvalidSpacing { get; }
Visual Basic
Public Shared ReadOnly Property DividedSurfaceInvalidSpacing As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceInvalidSpacing {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace